// fn main() {
//     // یک رشته در Heap ایجاد می‌کنیم
//     let s1 = String::from("سلام");
//
//     // انتقال مالکیت از s1 به s2
//     let s2 = s1;
//
//     // println!("{}", s1); // ❌ این خط باعث خطا می‌شود! چون s1 دیگر مالک نیست.
//
//     println!("{}", s2); // ✅ این خط کار می‌کند چون مالکیت به s2 منتقل شده است.
// }
////////////////////////////////////////////////////////////////////////////fn main() {
// fn main() {
//     let s1 = String::from("سلام");
//
//     // ایجاد یک کپی کامل از محتوا در Heap
//     let s2 = s1.clone();
//
//     println!("s1: {}", s1); // ✅ حالا s1 هم کار می‌کند!
//     println!("s2: {}", s2); // ✅ و s2 هم.
// }
////////////////////////////////////////////////////////////////////////////
// fn main() {
//     let s1 = String::from("Rust");
//
//     // به جای دادن مالکیت، فقط یک "مرجع" (&) به تابع می‌دهیم
//     let len = calculate_length(&s1);
//
//     println!("طول رشته '{}' برابر است با: {}", s1, len);
// }
//
// // این تابع یک Reference از String دریافت می‌کند (&String)
// // پس مالکیت را از main نمی‌گیرد.
// fn calculate_length(s: &String) -> usize {
//     s.len()
// }
////////////////////////////////////////////////////////////////////////////
fn main() {
    let mut my_str = String::from("Hello");

    // 1. ارسال به صورت Reference (&) برای خواندن طول
    print_len(&my_str);

    // 2. ارسال به صورت Mutable Reference (&mut) برای تغییر دادن محتوا
    add_world(&mut my_str);

    println!("Final: {}", my_str);
}

// این تابع فقط برای خواندن است، پس از & استفاده می‌کنیم
fn print_len(s: &String) {
    println!("Length of '{}' is: {}", s, s.len());
}

// این تابع قرار است رشته را تغییر دهد، پس از &mut استفاده می‌کنیم
fn add_world(s: &mut String) {
    s.push_str(" World");
}
////////////////////////////////////////////////////////////////////////////