// fn main() {
//     let number = 15;
//
//     // ۱. استفاده ساده از if/else
//     if number < 10 {
//         println!("عدد کوچک است");
//     } else if number == 15 {
//         println!("عدد دقیقاً ۱۵ است");
//     } else {
//         println!("عدد بزرگ است");
//     }
//
//     // ۲. استفاده از if به عنوان یک Expression (بسیار کاربردی!)
//     // در Rust می‌توانید نتیجه یک if را مستقیماً در یک متغیر بریزید.
//     let condition = true;
//     let number = if condition { 5 } else { 6 };
//
//     println!("مقدار عدد بر اساس شرط: {}", number);
// }
////////////////////////////////////////////////////////////////////////////
// fn main() {
//     let mut counter = 0;
//
//     loop {
//         counter += 1;
//         println!("تعداد: {}", counter);
//
//         if counter == 5 {
//             println!("رسیدیم به ۵، خارج می‌شویم!");
//             break; // خروج از حلقه
//         }
//     }
// }
////////////////////////////////////////////////////////////////////////////
// fn main() {
//     let mut number = 3;
//
//     while number != 0 {
//         println!("{}!", number);
//         number -= 1;
//     }
//
//     println!("انفجار! 🚀");
// }
////////////////////////////////////////////////////////////////////////////
fn main() {
    // پیمایش روی یک محدوده (از 1 تا 4)
    // دقت کنید: 1..5 یعنی از 1 شروع کن و قبل از 5 متوقف شو
    println!("--- Range ---");
    for i in 1..5 {
        println!("عدد: {}", i);
    }

    // پیمایش روی یک آرایه (که در جلسه قبل یاد گرفتید)
    println!("\n--- Array ---");
    let fruits = ["سیب", "موز", "گیلاس"];
    for fruit in fruits {
        println!("میوه: {}", fruit);
    }
}

////////////////////////////////////////////////////////////////////////////