// // تعریف یک تابع ساده که هیچ ورودی و خروجی ندارد
// fn say_hello() {
//     println!("سلام! به جلسه توابع خوش آمدید.");
// }
//
// fn main() {
//     // فراخوانی تابع
//     say_hello();
// }

////////////////////////////////////////////////////////////////////////
// fn main() {
//     print_sum(5, 10);
//     print_sum(20, 30);
// }
//
// // تابع که دو عدد صحیح دریافت می‌کند
// fn print_sum(a: i32, b: i32) {
//     let sum = a + b;
//     println!("مجموع: {}", sum);
// }
////////////////////////////////////////////////////////////////////////
// fn main() {
//     let result = add_numbers(10, 20);
//     println!("نتیجه با return: {}", result);
// }
//
// fn add_numbers(a: i32, b: i32) -> i32 {
//     return a + b; // استفاده از return
// }
////////////////////////////////////////////////////////////////////////
// fn main() {
//     let result = add_numbers_clean(10, 20);
//     println!("نتیجه بدون return: {}", result);
// }
//
// fn add_numbers_clean(a: i32, b: i32) -> i32 {
//     a + b // دقت کنید: در اینجا علامت ; وجود ندارد!
// }
////////////////////////////////////////////////////////////////////////
fn main() {
    let area = calculate_area(10.5, 20.4);
    println!("نتیجه بدون return: {}", area);
}

fn calculate_area(length: f64, width: f64) -> f64 {
    length * width // بدون سمیکالن
}
